# Создать строку равную третьему символу введенной строки.
# string = str(input('Введите строку: '))
# print(string[2])

# Создать строку равную предпоследнему символу введенной строки.
# string = str(input('Введите строку: '))
# print(string[-2])

# Создать строку равную первым пяти символам введенной строки.
# string = str(input('Введите строку: '))
# print(string[:5])

# Создать строку равную введенной строке без последних двух символов.
# string = str(input('Введите строку: '))
# print(string[:-2])

# Создать строку равную всем элементам введенной строки с четными индексами.
# string = str(input('Введите строку: '))
# print(string[::2])

# Запросить у пользователя два целых числа.Вывести строку вида “2 плюс 3 равно 5”
# num_1 = int(input('Введите число 1: '))
# print('Ваше число: ', num_1)
# num_2 = int(input('Введите число 2: '))
# print('Ваше число: ', num_2)
# num_3 = num_1 + num_2
# print(str(' %.2f плюс %.2f равно %.2f ' % (num_1, num_2, num_3)))

# Ввести предложение состоящее из двух слов.
# Поменять местами слова, добавить восклицательный знак в начало и конец, вывести итоговое предложение на экран.
# word_1 = input('Введите первое слово: ')
# word_2 = input('Введите второе слово: ')
# print(str('!%s %s!' % (word_2, word_1)))

# Ввести предложение. Если число символов в предложении кратно 3 - добавить ! к концу строки.
# Вывести строку на экран.
# word_1 = input('Введите предложение: ')
# if len(word_1) % 3 == 0:
#     print(word_1 + '!')
# else:
#     print(word_1)

# Создать переменные firstname, lastname, age с соответствующими значениями Путем сложения получить строку вида
# Привет, меня зовут Иван Иванов, мне 35 лет
# Примечание:
# Переменную age задавать как строку ‘35’
# firstname = 'Иван'
# lastname = 'Иванов'
# age = str(35)
# print('Привет, меня зовут ' + firstname + ' ' + lastname + ', мне ' + age + ' лет ')

# Дана строка
# string = 'Привет Андрей, привет привет'
# print(string[2])
# print(string[-2])
# print(string[:5])
# print(string[:-2])
# print(string[::2])
# print(string[1::2])
# print(string[::-1])
# print(string[::-2])
# print(len(string))
